app/Http/Controllers/Writer/BookingController.php

    public function index()
    {
       $rooms = Room::with('bookings')->where('writer_id',Auth::id())->get();
---
select * from `bookings` where `bookings`.`room_id` in (1, 2, 3, 4, 5, 6, 7, 8)
select * from `rooms` where `writer_id` = 1