app/Http/Controllers/Writer/ProfileController.php

select * from `writer_profiles` where `writer_id` = 1
---
    public function index()
    {
        //$p = Writer_profile::where('writer_id',Auth::id())->get()->first()->toArray();
        $p = Writer_profile::where('writer_id',Auth::id())->get()->first();

select * from `writer_profiles` where (`writer_id` = 1 and `id` = '1')
---
    public function edit($id)
    {
        $where = [
            'writer_id'=>Auth::id(),
            'id'=>$id
        ];
        $info = Writer_profile::where($where)->get()->first();