app/Http/Controllers/Writer/RoomController.php

select * from `photos` where `photos`.`room_id` in (5, 6, 7, 8, 9)
select * from `rooms` where `writer_id` = 1 order by `id` desc limit 5 offset 0
select * from `writers` where `writers`.`id` in (1)
select `amenities`.*, `amenities_room`.`room_id` as `pivot_room_id`, `amenities_room`.`amenities_id` as `pivot_amenities_id` from `amenities` inner join `amenities_room` on `amenities`.`id` = `amenities_room`.`amenities_id` where `amenities_room`.`room_id` in (5, 6, 7, 8, 9)
---
    public function index()
    {

        // if (Cache::has('roomindex')) {
        //     $rooms = Cache::get('roomindex');
        // }
        // else{
        //     $rooms = Room::with('writer')->where('writer_id',Auth::id())->orderBy('id','desc')->paginate(5);
        //     Cache::add('roomindex', $rooms, 20);
        // }
        $country = Country::pluck('name', 'id');
        $category = Category::pluck('name', 'id');
        $amenities = Amenities::pluck('name', 'id');
        //dd($amenities);
        $rooms = Room::with('photos', 'writer', 'amenities')->where('writer_id', Auth::id())->orderBy('id', 'desc')->paginate(5);

insert into `rooms` (`title`, `description`, `price`, `country_id`, `state_id`, `city_id`, `category_id`, `subcategory_id`, `latitude`, `longitude`, `accomodates_count`, `bedroom_count`, `bed_count`, `bathroom_count`, `start_date`, `end_date`, `availability_type`, `minimum_stay`, `writer_id`, `updated_at`, `created_at`) values ('Entire apartment hosted by Lam', 'A humble little place that\'s well located and budget friendly. The setup is minimal, yet be assured that all your essential requirements will be met. The place is an independent space with private entry. Meals are not provided, however all cooking amenities are available in the kitchen and many eating joints around the locality. Kindly enter the exact number of guests when booking and if you require transport, let me… read more', '100', '1', '2', '4', '1', '2', '22222', '4555', '1', '1', '1', '1', '2020-10-14', '2025-10-31', 0, 0, 1, '2020-10-14 05:36:28', '2020-10-14 05:36:28')
---
    public function store(Request $request)
    {
        //$amenities = $request->amenities;
        $writer = Auth::user();
        $room = new Room();
        $room->title = $request->title;
        $room->description = $request->description;
        $room->price = $request->price;
        $room->country_id = $request->country;
        $room->state_id = $request->state;
        $room->city_id = $request->city;
        $room->category_id = $request->category;
        //$room->category_id = 1;
        $room->subcategory_id = $request->subcategory;
        //$room->subcategory_id = 2;
        $room->latitude = $request->latitude ? $request->latitude : '0';
        $room->longitude = $request->longitude ? $request->longitude : '0';
        $room->accomodates_count = $request->accomodates_count;
        $room->bedroom_count = $request->bedroom_count;
        $room->bed_count = $request->bed_count;
        $room->bathroom_count = $request->bathroom_count;
        $room->start_date = $request->start_date;
        $room->end_date = $request->end_date;
        $room->availability_type = 0;
        $room->minimum_stay = 0;

        $writer->rooms()->save($room);

insert into `photos` (`name`, `room_id`, `updated_at`, `created_at`) values ('1602653788_1_128797.jpg', 9, '2020-10-14 05:36:29', '2020-10-14 05:36:29')
---
                    //insert into picture table
                    $pic = new Photo();
                    $pic->name = $name;
                    $room->photos()->save($pic);

select * from `states` where `country_id` = '1'
---
    public function selectstate($id)
    {
        $state = State::where('country_id', $id)->get()->toArray();

select * from `cities` where `state_id` = '2'
---
    public function selectcity($id)
    {
        $city = City::where('state_id', $id)->get()->toArray();

select * from `subcategories` where `category_id` = '1'
---
    public function selectsubcat($id)
    {
        $subcat = Subcategory::where('category_id', $id)->get()->toArray();