app/Http/Controllers/BookingController.php

    public function bookroom($roomid){
        //$user = Auth::id();
        $roominfo = Room::with('writer.profile')->find($roomid);
---
select * from `rooms` where `rooms`.`id` = '9' limit 1
select * from `writers` where `writers`.`id` in (1)

    public function step1(Request $request){
        //$sdate = $request->startdate;
        //$edate = $request->enddate;
        //$guests = $request->guests;
        //$rid = $request->roomid;

        $room = Room::find($request->roomid);
//        $datef = new Carbon($request->startdate, 'Asia/Dhaka');
//        $datet = new Carbon($request->enddate, 'Asia/Dhaka');
//        CommonFx is our custom class in App\MyClass
        $totalDays = CommonFx::totalDays($request->startdate,$request->enddate);
        //return response()->json(['success'=>true,'message'=>$totalDays]);
        $booking = new Booking();
        $booking->user_id = Auth::id();
        $booking->currency_id = 1;
        $booking->check_in_date = $request->startdate;
        $booking->check_out_date = $request->enddate;
        $booking->price_per_day = $room->price;
        $booking->price_for_stay = (float) ($totalDays * $room->price);
        $booking->tax_paid = 0;
        $booking->site_fees = 0;
        $booking->amount_paid = 0;
        $booking->refund_paid = 0;
        $booking->effective_amount = 0;
        $booking->booking_date = date('Y-m-d H:i:s');
        $booking->status = 0;
        if ($room->bookings()->save($booking)) {
---
insert into `bookings` (`user_id`, `currency_id`, `check_in_date`, `check_out_date`, `price_per_day`, `price_for_stay`, `tax_paid`, `site_fees`, `amount_paid`, `refund_paid`, `effective_amount`, `booking_date`, `status`, `room_id`, `updated_at`, `created_at`) values (3, 1, '2020-10-14', '2020-10-16', '50.00', 100, 0, 0, 0, 0, 0, '2020-10-13 18:05:39', 0, 7, '2020-10-13 18:05:39', '2020-10-13 18:05:39')