app/Http/Controllers/PropertyController.php

select * from `photos` where `photos`.`room_id` in (6)
select * from `rooms` where `rooms`.`id` = '6' limit 1
select * from `writers` where `writers`.`id` in (1)
select `amenities`.*, `amenities_room`.`room_id` as `pivot_room_id`, `amenities_room`.`amenities_id` as `pivot_amenities_id` from `amenities` inner join `amenities_room` on `amenities`.`id` = `amenities_room`.`amenities_id` where `amenities_room`.`room_id` in (6)
---
    public function show($id)
    {
        $roominfo = Room::with('amenities','photos','writer.profile')->find($id);