app/Http/Controllers/ReviewController.php

    public function store(Request $request)
    {

        if(!Auth::check()){
            return response()->json(['success' => true, 'message' =>'guest']);
        }
        $user=Auth::user();
        $review = new Review();
        $review->room_id = $request->room_id;
        $review->booking_id = 1;
        $review->comment = $request->review;
        $review->accuracy = $request->accuracy;
        $review->location = $request->location;
        $review->communication = $request->communication;
        $review->checkin = $request->checkin;
        $review->cleanliness = $request->cleanliness;
        $review->value = $request->cleanliness;
        $user->reviews()->save($review);
---
insert into `reviews` (`room_id`, `booking_id`, `comment`, `accuracy`, `location`, `communication`, `checkin`, `cleanliness`, `value`, `user_id`, `updated_at`, `created_at`) values ('6', 1, 'nice', '5', '5', '5', '5', '5', '5', 3, '2020-10-13 17:43:57', '2020-10-13 17:43:57')