app/Http/Controllers/WelcomeController.php

    public function index(Request $request){

        // if($request->cat){echo $request->cat;}
        // if($request->scat){echo $request->scat;}
        // if($request->c){echo $request->c;}
        //exit;
        $cat = Category::where('status','1')->pluck('name','id');
        $subcat = Subcategory::where('status','1')->pluck('description','id');
        $country = Country::where('status','1')->pluck('name','id');
        $state = State::where('status','1')->pluck('name','id');
        $city = City::where('status','1')->pluck('name','id');
        $amenities = Amenities::where('status','1')->pluck('name','id');

        $allRoom = new Room;
        if($request->cat){$allRoom = $allRoom->where('category_id',$request->cat);}
        if($request->scat){$allRoom = $allRoom->where('subcategory_id',$request->scat);}
        if($request->c){$allRoom = $allRoom->where('country_id',$request->c);}
        if($request->s){$allRoom = $allRoom->where('state_id',$request->s);}
        if($request->city){$allRoom = $allRoom->where('city_id',$request->city);}

        $allRoom = $allRoom->with('photos','amenities','writer','category','subcategory','country','state','city')->orderBy('id','desc')->paginate(10);
        //dd($allRoom);
        return view('welcome.index')
        ->with('rooms',$allRoom)
        ->with('categories',$cat)
        ->with('subcategories',$subcat)
        ->with('amenities',$amenities)
        ->with('countries',$country)
        ->with('states',$state)
        ->with('cities',$city);
---
select `name`, `id` from `categories` where `status` = '1'
select `description`, `id` from `subcategories` where `status` = '1'
select `name`, `id` from `countries` where `status` = '1'
select `name`, `id` from `states` where `status` = '1'
select `name`, `id` from `cities` where `status` = '1'
select `name`, `id` from `amenities` where `status` = '1'
select * from `categories` where `categories`.`id` in (1, 2, 15)
select * from `cities` where `cities`.`id` in (1, 4)
select * from `countries` where `countries`.`id` in (1)
select * from `photos` where `photos`.`room_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9)
select * from `rooms` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `rooms` where `category_id` = '1' and `subcategory_id` = '1' and `country_id` = '1' and `state_id` = '2' and `city_id` = '4'

    public function selectstate($id)
    {
        $state = State::where('country_id', $id)->get()->toArray();
---
select * from `states` where `country_id` = '1'

    public function selectcity($id)
    {
        $city = City::where('state_id', $id)->get()->toArray();
---
select * from `cities` where `state_id` = '2'

    public function selectsubcat($id)
    {
        $subcat = Subcategory::where('category_id', $id)->get()->toArray();
---
select * from `subcategories` where `category_id` = '1'