app/Http/Controllers/Admin/AmenitiesController.php

    public function index()
    {
        $ameniti = Amenities::latest()->paginate(config('room.pagesize'));
---
select * from `amenities` order by `created_at` desc limit 10 offset 10
select count(*) as aggregate from `amenities`