app/Http/Controllers/Admin/BookingController.php

    public function index()
    {
        $book = Booking::with('room','user')->latest()->paginate(2);
---
select * from `bookings` order by `created_at` desc limit 2 offset 0
select * from `rooms` where `rooms`.`id` in (7)
select * from `users` where `users`.`id` in (3)
select count(*) as aggregate from `bookings`

    public function setapproval(Request $request){
        $id =$request->id;
        $bookapproval = Booking::find($id);
        if($request->action=="allow"){
            $bookapproval->status=1;
        }
        if($request->action=="deny"){
            $bookapproval->status=0;


        }
            $bookapproval->update();
---
update `bookings` set `status` = 1, `updated_at` = '2020-10-13 18:07:38' where `id` = 9